Revit 2018 API
ExternalResourceBrowserData.FolderPath Property
 The current folder path to which the new resources and sub folder belong.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2015
Syntax
C#
public string FolderPath { get; }
Visual Basic
Public ReadOnly Property FolderPath As String
	Get
Visual C++
public:
property String^ FolderPath {
	String^ get ();
}
See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace